/****************************************************************
*                     КАФЕДРА № 304 1 КУРС                      *
*---------------------------------------------------------------*
* Project Type  : GNU/Linux Console Application                 *
* Project Name  : proj_2                                        *
* File Name     : main.cpp                                      *
* Language      : C/C++                                         *
* Programmer(s) : Егоров А.В (swrneko), Федоров А.И.            *
* Modifyed By   : Егоров А.В (swrneko)                          *
* Edited by     : Neovim, Visual Studio                         *
* OS            : Arch Linux, Windows 11                        *
* Github url    : https://github.com/swrneko/mai_shit.git       *
* Created       : 13/11/24                                      *
* Last Revision : 24/11/24                                      *
* Comment(s)    : Табулирование функций.                        *
****************************************************************/

/****************************************
* Подключение препроцессора и библиотек *
****************************************/
#include <cmath>
#include <iostream>
#include <iomanip>
using namespace std;

/**********
* Дефайны *
**********/
#define step_lenth ((b - a) / n) // Формула величины шага
#define arg_increment (a + (i * h)) // Формула приращения аргумента
#define F(x) (2 - cos(x)) // F(x)
#define G(x) (1 - pow(x,2)) // G(x)

/*************
* Переменные *
*************/
float a; // Начальная точка отрезка
float b; // Конечная точка отрезка
float h; // Величина шага
float x; // Аргумент функций
int n; // Количество интервалов
int i = 0; // Счётчик итераций цикла

/****************
* Основное тело *
****************/
int main() {
  // Ввод начальной информации
  cout << "Введите точку А: ";
  cin >> a;
  cout << "Введите точку B: ";
  cin >> b;

  if (a > b){
    cout << "Значение т. A должно быть меньше значения т. B." << endl << "Повторите корректный ввод перезапустив программу." << endl << "Досрочное завершение: Ошибка ввода." << endl;
    exit(1);
  }

  cout << "Введите количество интервалов N: ";
  cin >> n;

  if (n <= 0) {
    cout << "Количество интервалов(N) должно быть больше 0." << endl << "Повторите корректный ввод перезапустив программу." << endl << "Досрочное завершение: Ошибка ввода." << endl;
    exit(1);
  }
  else {
    h = step_lenth; // Вычисление шага
  }

  // Вывод таблицы
  cout << "-----------------------------------------" << endl;
  cout << "| N " 
       << setw(9) << " | X  "
       << setw(13) << " | F     "
       << setw(13) << "  | G         |"
       << endl;
  cout << "-----------------------------------------" << endl;

  // Основные вычисления
  while (i != n) {
    i += 1;
    x = arg_increment; // Приращение аргумента
    cout.width(0);
    cout << fixed << setprecision(5) // Установка точности в 5 знаков после запятой
         << "| " << setw(6) 
         << left << i 
         << "| " << setw(8)
         << left << x 
         << "| " << setw(8)
         << left << F(x) 
         << "| " << setw(9)
         << left << G(x) 
         << " |" 
         << endl;
  cout << "-----------------------------------------" << endl;
  }
}
